{
"meetings": [
{
    "date": "2020 June 3",
    "deliverables": [
        "Present a lecture on the methods and concepts presented in <a href='https://distill.pub/2020/growing-ca/'>Growing Neural Cellular Automata</a>"
    ],
    "discussion": [
        "TBD"
    ],
    "continuing": [
        "TBD"
    ]
},
{
    "date": "2020 April 8",
    "deliverables": [
        "More reading from Eiben &amp; Smith"
    ],
    "discussion": [
        "Discussion of research results found in <a href='https://distill.pub/2020/growing-ca/'>Growing Neural Cellular Automata</a>",
        "It is possible the results are generated only after a very time-consuming and resource-intensive training period that we might not have the ability to replicate.",
        "Cellular Automata with the morphogenesis qualities produced might not be interesting for our goals of study: replicating a given pattern rather than generating patterns in the first place."
    ],
    "continuing": [
        "Present a lecture on the methods and concepts presented in the paper"
    ]
},
{
    "date": "2020 February 19",
    "deliverables": [
        "Research goal: focused on developing a model capable of evolution of a wide range of self-organizing behaviors",
        "From Evolutionary Computing reading: probably want to focus on EAs, make a case for this",
        "Rudimentary EA is showing slow but positive evolution with shift-stochastic model. Nothing is achieving high performance yet though, just overall growth in the population",
        "From EC reading: consider self-adaptation (pg. 58), having co-evolving parameters. How useful could this be in a highly-corrugated landscape?"
    ],
    "discussion": [
        "Undergoing formalization of CA stochastic-shift model",
        "Quick convergence of Evolutionary Strategy implemented so far is likely due to the lack of sophistication in the current method and is common (even expected)",
        "Explore the model more by setting up several (hand-crafted) scenarios and seeing if it exhibits intuitive behavior, or behavior that we would want from a model that could evolve self-organizing behaviors. Adjust the model as needed. Thinking about switching to evolving rules was triggered by some of the pathological features the model has shown so far, but we can probably fix these with some adjustment to the model."
    ],
    "continuing": [
        "Continue reading about Evolutionary Computing and try to implement some more sophisticated EC strategies",
        "Set up experiments and test the model's fitness to intuition, described in the discussion",
        "Finish a formalization of the stochastic-shift model."
    ]
},
{
    "date": "2020 February 12",
    "deliverables": [
        "Overall development idea",
        "Questions about learning resources and weekly housekeeping"
    ],
    "discussion": [
        "<a href='https://en.wikipedia.org/wiki/Evolutionary_algorithm'>Evolutionary Algorithms</a> - big picture, generic, lots of freedom",
        "Local optimizations &amp; bias",
        "Exploration &amp; Exploitation",
        "<a href='https://en.wikipedia.org/wiki/Genetic_algorithm#/Elitism'>Elitism</a>",
        "Perturbation - stochastically perturb a subset of the population, introducing additional random variation"
    ],
    "continuing": [
        "Thesis website",
        "Eiben &amp; Smith - Introduction to Evolutionary Computing",
        "<strong>Summarized research goals</strong>"
    ]
}

]
}